var e=`---
title: '推荐两款优秀的系统清理软件'
date: 2020-04-15 22:37:15
tags: [Software, Recommendation]
comment: giscus
cover: /img/cleanerapptj-1.png
---
# 1. CCleaner

> 2026 年更新：此软件不再推荐，建议看看 [CCleaner 使用的数据库](https://github.com/MoscaDotTo/Winapp2)下有什么选择

不用我多说，它可以清理跟踪器、注册表、缓存文件等等等等，还可以自定义选择，当然，它还可以完全卸载顽固软件，升级国外的软件
当然问题很明显，不付费很多功能没法用，但基本上够用了，如果使用了 Professional 版，关闭浏览器会弹出一个很烦人的小窗口，如果你使用断网破解方式，等个几天，会是不是弹出许可证到期通知，但事实上并非如此，另外清理一次产生缓存也有 500MB。。。
直接上官网链接！
[官网](https://www.ccleaner.com/ccleaner/)
如果要白嫖 Professional 版，下载试用版，安装后选择立即激活，输入密钥 C2YM-XZT7-A4SE-UD89-YZPC，名称随便写，空着也行，然后要断网，要断网，要断网，这很重要，然后点击注册，确定一下，就进入程序了，永久激活，这时就可以重新联网了，当然我更提倡购买正版啊
# 2. 360清理大师
你们听到 360 的第一印象肯定是捆绑啊，广告啊，但这款软件是 360 又一个良心之作，无捆绑，无广告，官网免费下载，说白了，它就是 360 安全卫士优化功能的官方提取版，在用 360 安全卫士的可以忽略
这个软件的问题是功能太简单了，在 1440x900 等低分辨率屏幕不是很友好，程序是一坨挡在中间，占了 1/3 的屏幕空间，对 1920x1080 比较友好
这款软件我还没有深度体验，请各位自己玩玩
[官网](http://www.360.cn/n/11298.html)
翻到下载进行下载
<!-- more -->
好啦，这就是我推荐的这两款优秀的系统清理软件
顺带一提，我没在打广告哦😛`;export{e as default};