var e=`---
title: 关于部分文章下架须知
comment: giscus
date: 2025-10-18 03:07:54
tags: ThisBlog
---

## 发生什么了？

如你所见，我下架了大量本站的文章。

很高兴又各位的支持，但是坦白说，随着阅历的增多和一些其他原因，我愈发感觉这个博客的一些文章有点 **silly** （蠢的）。

例如大量未经证实的资料道听途说就直接公布，当然还有不少带有煽动性的言论......

我曾想过是否有必要继续维护这个博客，许多次的答案都是“是”，再加上学习压力的冲击，确实，我有点累了。

但自从 2024 年的一时冲动购买了域名（\`damon233.top\`，现在因为一些原因可能该域名在2034年到期后没有机会续签），我还是想着打理一下博客，至少改一下页尾的版权年份。

决定继续维护博客带来的就结果就是我会偶尔关注我以前的哪一些文章，怎么看怎么别扭，最后还是决定一次性下架吧，然后就有了这一件事情。

## 未来发展方向

毕竟是玩技术的，我打算让博客内容逐步向技术内容迁移，当然帮朋友或自己宣传东西这类不算“太傻”的文章也会写写，还有一些非常主观的吐槽。但毕竟不是全职，我也只是一个学生，再加上个人添置了一个新设备（MacBook Pro 2024 Nov, \`Mac16,1\`）并且因为一些需求越用越多，此博客更新频率会更加带有随机性（目前博客的所有资源目前都存在我的 Windows 设备上，迁移搞环境配置太糟心了，并且两台设备的交替使用也有可能会导致一些“打架”）。

当然了，我在不少写作平台都有账号，未来我在这些平台的作品如果有一定的价值，也会考虑给本博客加点小料。

## 但是我还想看......

对于部分文章，下架只是暂时的，在进行了调整之后，它们有概率会重新上架（保留原来的发布日期），但对于那些有一定煽动性，或者主要通过“洗稿”完成的文章，当然还有一些蠢到不能在蠢的门外汉型技术文章，大概率是没有希望了。

不过这不代表这没有任何机会，本站笔记是在 GitHub Pages 托管，你可以看看我以前的提交，在那里也能找到你所需要的东西，互联网档案馆的 Wayback Machine 如果有存档，你也可以翻翻看。

~还有一点是那些文章使用的图片我并不打算删除，假装被某些人直接链接使用了，贸然删除总不太恰当。~（本站更新时为了精简，最终依旧决定删除大部分）

***

总之，事已至此，本站的改革之路已经开始，其他的不用再关注，尽我所能让量的积累实现质的变化，也算是我对这个快节奏的互联网一个小小的贡献吧......

`;export{e as default};